Repository: sushain97/apertium-monorepo-svn-82937
Catalog: incubator/en-ga-corpus/tmx/1922-4.tmx
Source language: en
Languages: ga

source: LOCAL ELECTIONS POSTPONEMENT ACT, 1922
ga: ACHT CHUN TOGHACHÁIN ÁITIÚLA DO CHUR AR ATH-LÓ, 1922

source: WHEREAS under the Statutes now in force in Saorstát Eireann elections of the members of borough, county borough and urban district councils and of town commissioners are required to be held in the month of January 1923 and elections of members of county and rural district councils and of other local bodies are required to be held in the month of June and at divers other times in the year 1923:
ga: DE BHRÍ go n-éilítear fé sna Reachtanna atá i bhfeidhm anois i Saorstát Éireann go gcomórfaí toghacháin de bhaill chomhairlí buirge, contae buirge agus ceantair bhaile agus de choimisinéirí baile i mí Eanair, 1923, agus go gcomórfaí toghacháin de bhaill chomhairlí contae agus ceantair thuaithe agus de chóluchtaí áitiúla eile i mí an Mheithimh agus ar iol-uairibh eile sa mbliain, 1923:

source: AND WHEREAS owing to the non-completion of the Register of Local Government Electors now in course of preparation and for other reasons it is necessary that the said elections required to be held in the month of January 1923 should be postponed to a later date in that year and for the like reasons it may become necessary that some or all of the said elections required to be held at other times in the year 1923 should also be postponed:
ga: AGUS DE BHRÍ, toisc gan an Clár de Thoghthóirí um Rialtas Áitiúil atá á ullamhú anois do bheith críochnuithe agus mar gheall ar réasúin eile, gur gá na toghacháin roimh-ráite a éilítear a chomóra i mí Eanair, 1923, do chur ar ath-ló go dáta níos déanaí sa mbliain sin agus mar gheall ar na réasúin chéanna go mbéidir gur ghá cuid no gach ceann de sna toghacháin a éilítear a chomóra ar uairibh eile sa mbliain, 1923, do chur ar ath-ló leis:

source: AND WHEREAS any such postponement of the elections aforesaid involves consequential amendments and adaptations of the existing law relating to such elections
ga: AGUS DE BHRÍ, má dintear na toghacháin roimh-ráite do chur ar aon ath-ló den tsórt san, go gcaithfear leasuithe agus oiriúntaisí do dhéanamh ar an ndlí shealbhaigh a bhaineann leis na toghacháin sin

source: BE it therefore enacted by the Oireachtas of Saorstát Eireann as follows:—
ga: ACHTUIGHEADH Oireachtas Shaorstáit Éireann ar an abhar san mar leanas:—

source: —(1) Every statutory election of councillors of boroughs, councillors of urban districts and commissioners of towns which but for this Act would be held within twelve months after the passing of this Act shall be postponed until such date not being later than the 1st day of January 1924 as the Minister shall by order prescribe
ga: —(1) Gach toghachán reachtúil de chomhairleoirí buirg, de chomhairleoirí ceantar baile agus de choimisinéirí bailte a comórgaí mara mbeadh an t-Acht so laistigh de dhá mhí déag tar éis rithte an Achta so cuirfear ar ath-ló é go dtí an dáta san a cheapfaidh an t-Aire le hordú, agus ná beidh níos déanaí ná an ladh lá d'Eanair, 1924

source: (2) Any order under this section (including orders under this sub-section) prescribing a date for the holding of a statutory election may be revoked by a subsequent order but in every such case a new date for the holding of such election shall be prescribed by such subsequent order
ga: (2) Aon ordú fén alt so (mar aon le horduithe fén bhfó-alt so) a cheapfaidh dáta chun comóra toghacháin reachtúla féadfar é d'ath-ghairm le hordú eile 'na dhiaidh sin ach i ngach cás dá shórt caithfidh an tordú eile sin dáta nua chun comóra an toghacháin sin do cheapa

source: —(1) The Minister if in his opinion it is necessary or expedient so to do may by order postpone all or any of the statutory elections to county elections of county councillors, councillors of rural districts or members of any other local body which but for this Act would be held at any time within twelve months after the passing of this Act until such date not being later than the 1st day of January 1924 as the Minister shall by such order prescribe
ga: —(1) Féadfaidh an t-Aire má's é a oipineon gur gá no gur oiriúnach san do dhéanamh gach ceann no aon cheann de sna toghacháin reachtúla de chomhairleoirí contae, de chomhairleoirí ceantar tuaithe no de bhaill d'aon chólucht áitiúil eile a comórfaí mara mbeadh an t-Acht so aon uair laistigh de dhá mhí déag tar éis rithte an Achta so, do chur ar ath-ló le hordú go dtí an dáta san a cheapfaidh an t-Aire leis an ordú san agus ná beidh níos déanaí ná an 1adh lá d'Eanair, 1924

source: (2) Separate orders may be made at different times under this section for the postponement of the statutory elections to different classes of councils or other local bodies and different dates may be prescribed for the holding of such postponed elections and any election which is postponed by an order under this section may from time to time be further postponed by subsequent orders
ga: (2) Féadfar orduithe ar leithligh do dhéanamh ar uairibh éagsúla fén alt so chun na toghacháin reachtúla chun saghasanna éagsúla comhairlí no cóluchtaí áitiúla eile do chur ar ath-ló agus féadfar dátaí éagsúla do cheapa chun comóra na dtoghachán san a cuirfear ar ath-ló agus aon toghachán a cuirfear ar athló le hordú fén alt so féadfar é do chur ar ath-ló arís ó am go ham le horduithe eile 'na dhiaidh sin

source: —The term of office of all existing Councillors, Commissioners and members of any council, Commissioners or other local body the statutory elections to which are postponed by or under this Act shall be extended to the day after the prescribed date
ga: —Téarma oifige na gComhairleoirí, na gCoimisinéirí agus na mball sealbhacha d'aon Chomhairle, d'aon choimisinéirí no d'aon chólucht áitiúil eile go ndéanfar na toghacháin reachtúla chúcha do chur ar ath-ló leis no fén Acht so, déanfar é do shíne go dtí an lá tar éis an dáta cheaptha

source: —(1) The Minister shall in every order made by him under this Act prescribing the date on which any statutory election is to be held also prescribe the date on which the first meeting of every Council, body of Commissioners and other local body referred to in such order is to be held after such election
ga: —(1) I ngach ordú a dhéanfaidh an t-Aire fén Acht so ag ceapa an dáta ar a gcomórfar aon toghachán reachtúil ceapfaidh sé chó maith an dáta tar éis an toghacháin sin ar a gcomórfar an chéad chruinniú de gach Comhairle, cólucht Coimisinéirí agus cólucht áitiúil eile dá dtagartar san ordú san

source: (2) Every Council, body of Commissioners and other local body the statutory elections to which are postponed by or under this Act, shall hold its first meeting after such election on the date prescribed for that purpose by the Minister under this section and shall transact at such meeting all the business which such Council, Commissioners or other local body is by any statute order or regulation required to transact at an annual meeting or a quarterly meeting (as the case may be) held next after a statutory election
ga: (2) Comórfar an chéad chruinniú de gach Comhairle, de gach cólucht Coimisinéirí agus de gach cólucht áitiúil eile go ndéanfar na toghacháin reachtúla chúcha do chur ar ath-ló leis no fén Acht so, tar éis an toghacháin sin, ar an ndáta a cheapfaidh an t-Aire chun na críche sin fén alt so; agus déanfar ag an gcruinniú san an gnó uile gur gá don Chomhairle, do sna Coimisinéirí no don chólucht áitiúil eile sin é do dhéanamh do réir aon reachta, orduithe no rialach ag an gcéad chruinniú bliantúil no ag an gcéad chruinniú ráithiúil (fé mar a bheidh) a comórfaí tar éis toghacháin reachtúla

source: (3) Such of the existing members of any board, committee, joint board or joint committee as are nominated or elected by any Council, body of Commissioners or other local body the statutory elections to which are postponed by or under this Act shall continue in office as such members until the day after the date on which the first meeting of such Council, body of Commissioners or other local body after the statutory election thereto is held pursuant to this section
ga: (3) Pé baill shealbhacha d'aon bhórd, choiste, chó-bhórd no chó-choiste do hainmníodh no do toghadh ag aon Chomhairle, chólucht Coimisinéirí no chólucht áitiúil eile go ndéanfar na toghacháin chúcha do chur ar ath-ló leis no fén Acht so, leanfaid in oifig, ina mbaill mar sin, go dtí an lá tar éis an dáta ar a gcomórfar an chéad chruinniú den Chomhairle, den chólucht Coimisinéirí no den chólucht áitiúil eile sin tar éis an toghachán reachtúil chuige do chomóra do réir an ailt seo

source: In this sub-section "existing" means holding office on the prescribed date
ga: Sa bhfo-alt so cialluíonn “sealbhacha” bheith in oifig ar an ndáta ceaptha

source: (4) Every Lord Mayor, Mayor, Chairman and Vice-Chairman of or appointed by any Council, body of Commissioners or other local body the statutory elections to which are postponed by or under this Act who is in office at the passing of this Act or on the prescribed date shall continue in office until but not after his successor shall have been duly elected at the first meeting of such Council, body of Commissioners or other local body after the statutory elections thereto and shall have made the declaration accepting office
ga: (4) Gach Árd-Mhéire, Méire, Cathaoirleach agus Leas-Chathaoirleach atá ar no do ceapadh ag aon Chomhairle, chólucht Coimisinéirí no chólucht áitiúil eile go ndéanfar na toghacháin reachtúla chuige do chur ar ath-ló leis no fén Acht so agus a bheidh in oifig le linn rithte an Achta so no ar an ndáta ceaptha leanfaidh sé in oifig go dtí go dtoghfar a chomharba go cuibhe ag an gcéad chruinniú den Chomhairle, den chólucht Coimisinéirí no den chólucht áitiúil eile sin tar éis na dtoghachán reachtúil chuige agus go dtí go ndéanfaidh a chomharba an deimhniu go nglacfa sé an oifig; agus go dtí san amháin

source: (5) In this section the expressions "annual meeting" and "quarterly meeting" respectively mean any annual meeting or quarterly meeting (as the case may be) the date of which is prescribed by or under the Local Government (Ireland) Act, 1898
ga: (5) San alt so sé a chialluíonn na habairtí “Cruinniú bliantúil” agus “Cruinniú ráithiúil” fé seach ná aon chruinniú bliantúil no chruinniú ráithiúil (fé mar a bheidh) go ndintear a dháta do cheapa leis no fén Acht um Rialtas Áitiúil (Éirinn) 1898

source: —(1) Every casual vacancy which shall occur among the members of any borough council or urban district council or among the commissioners of any town after the passing of this Act and before the prescribed date and which but for this section ought to be filled by election may be filled by means of the choice by such council or commissioners of a person to fill the vacancy, but not otherwise, and any councillor or commissioner so chosen shall hold office in all respects as if he had been elected to fill the vacancy
ga: —(1) Gach foth-fhollamhntas a thárlóidh imeasc ball aon chomhairle bhuirge no chomhairle cheantair bhaile no imeasc coimisinéirí aon bhaile tar éis rithte an Achta so agus roimh an dáta ceaptha agus gur cheart mara mbeadh an t-alt so é do líona le togha féadfar é do líona ach an chomhairle no na coimisinéirí sin do chó-thogha duine chun an follamhntas do líona agus ní ar a mhalairt de chuma agus aon chomhairleoir no choimisinéir a có-thoghfar mar sin sealbhóidh sé a oifig i ngach slí fé is dá ndéanfaí é do thogha chun an follamhntas do líona

source: (2) Every casual vacancy among the members of any council or other local body the statutory elections to which are postponed by the Minister under this Act which shall occur after the date of an order postponing the statutory elections to such council or local body and before the prescribed date and which but for this section ought to be filled by election may be filled by means of the choice by such council or other local body of a person to fill the vacancy, and any councillor or member so chosen shall hold office in all respects as if he had been elected to fill the vacancy but not otherwise
ga: (2) Gach foth-fhollamhntas imeasc ball aon chomhairle no chóluchta áitiúla eile go ndéanfaidh an t-Aire na toghacháin reachtúla chuige do chur ar ath-ló fén Acht so, agus a thárlóidh tar éis dáta ordú a chuirfidh ar ath-ló na toghacháin reachtúla chun na comhairle no an chóluchta áitiúla san agus roimh an dáta ceaptha agus gur cheart mara mbeadh an t-alt so é do líona le togha féadfar é do líona ach an chomhairle no an cólucht áitiúil sin do chó-thogha duine chun an follamhntas do líona agus aon chomhairleoir no bhall a có-thoghfar mar sin sealbhóidh sé a oifig i ngach slí fé is dá ndéanfaí é do thogha chun an follamhntas do líona agus ní ar a mhalairt de chuma

source: —(1) No councillor of any borough or councillor of an urban district or commissioner of a town who shall resign his office as such councillor or commissioner at any time after the passing of this Act and before the prescribed date shall be liable to any fine or other penalty for or on account of his so resigning his office
ga: —(1) Aon chomhairleoir d'aon bhuig no aon chomhairleoir d'aon cheantar baile no aon choimisinéir d'aon bhaile a eireoidh as a oifig mar chomhairleoir no mar choimisinéir aon tráth tar éis rithte an Achta so agus roimh an dáta ceaptha ní bheidh sé i mbaol aon fhíneála no phionóis eile i dtaobh no mar gheall ar eirghe as a oifig mar sin

source: (2) No councillor of a county or rural district council or member of any other local body the statutory elections to which are postponed by the Minister under this Act who shall resign his office as such councillor or member after the date of an order postponing the statutory elections to such council or body and before the prescribed date shall be liable to any fine or other penalty for or on account of his so resigning his office
ga: (2) Aon chomhairleoir d'aon chomhairle chontae no cheantair thuaithe no aon bhall d'aon chólucht áitiúil eile go ndéanfaidh an t-Aire na toghacháin reachtúla chuige do chur ar ath-ló fén Acht so, a eireoidh as a oifig mar chomhairleoir no mar bhall tar éis dáta ordú a chuirfidh ar ath-ló na toghacháin reachtúla chun na comhairle no an chóluchta san agus roimh an dáta ceaptha ní bheidh sé i mbaol aon fhíneála no phionóis eile i dtaobh no mar gheall ar eirghe as a oifig mar sin

source: —Every period of office or other period of time which is by any statute, order or regulation to be computed from the date of a statutory election (other than periods relating to the first meeting after a statutory election) shall in the case of every Council, body of Commissioners and other local body the statutory elections to which are postponed by or under this Act be computed from the date on which such statutory elections would have been held if this Act had not been passed and not from the date on which such statutory elections are actually held
ga: —Gach tréimhse oifige no tréimhse eile ama a bheidh le háireamh, do réir aon reachta, orduithe no rialach, ó dháta thoghacháin reachtúla (in iongnais tréimhsí a bhaineann lesi an gcéad chruinniú tar éis toghacháin reachtúla) áireofar é, i gcás gach Comhairle, cóluchta Coimisinéirí agus cóluchta áitiúla eile go ndéanfar na toghacháin reachtúla chúcha do chur ar ath-ló leis no fén Acht so, ón ndáta ar a gcomórfaí na toghacháin reachtúla san dá mba ná rithfí an t-Acht so agus ní ón ndáta ar a ndéanfar na toghacháin reachtúla san do chomóra

source: —(1) Every provision of every statute, order and regulation relating to any statutory election which is postponed by or under this Act to any councillor, commissioner or member of a local body whose term of office, is extended by or under this Act shall be construed as if the same had been modified to the extent (if any) and in the manner necessary to give effect to the provisions of this Act
ga: —(1) Gach foráil de gach reacht, ordú agus riail a bhaineann le haon toghachán reachtúil a cuirfear ar ath-ló leis no fén Acht so no le haon chomhairleoir, choimisinéir no bhall de chólucht áitiúil go ndéanfar a théarma oifige do shíne leis no fén Acht so léireofar é fé is dá ndéanfaí é d'atharú sa méid (má bhíonn ann) agus sa tslí is gá chun feidhm do thabhairt d'fhorálacha an Achta so

source: (2) If any doubt, dispute, or question shall arise or in the opinion of the Minister be likely to arise as to the modification which is to be made under this section in the construction of any statute, order or regulation the Minister may by order specify the modification which is to be made therein
ga: (2) Má thárluíonn aon amhras, achrann no cheist no in oipineon an Aire más deallrathach go dtárlóidh i dtaobh aon atharuithe a bheidh le déanamh fén alt so i léiriú aon reachta, orduithe no rialach féadfaidh an t-Aire le hordú an t-atharú a bheidh le déanamh ann do luadh

source: —In this Act—the expression "Borough" includes "County Borough," the expression "Councillor" includes "Alderman"; the word "existing" when used in respect of a councillor of a borough council or urban district council or commissioner of a town means holding office at the date of the passing of this Act and when used in respect of a councillor of any other council or a member of any other local body means holding office at the date of the order postponing the statutory elections to such council or body; the expression "Statutory Election" means an election to fill the places of councillors, commissioners or members of a local body retiring on the expiration of their term of office; the expression "Prescribed Date" means the date prescribed under this Act by the Minister for the holding of the statutory elections to the council, body of commissioners or other local body to which the expression relates; the expression "The Minister" means the Minister for Local Government; the expression "Local Body" means any body whose accounts are required by or under any statute to be audited by an auditor appointed by the Minister; the word "Statute" includes Act of the British Parliament having the force of law in Saorstát Eireann as well as Act of the Oireachtas
ga: —San Acht so—foluíonn an abairt “Buirg” “Buirg Chontae,” foluíonn an abairt “Comhairleoir” “Seanóir”; an focal “sealbhach” nuair úsáidtear é i dtaobh comhairleora comhairle bhuirge no comhairle cheantair bhaile no choimisinéara baile cialluíonn sé bheith in oifig ar dháta rithte an Achta so agus nuair a úsáidtear é i dtaobh comhairleora aon chomhairle eile no i dtaobh baill aon chóluchta áitiúla eile cialluíonn sé bheith in oifig ar dháta an orduithe a dhéanfaidh na toghacháin reachtúla chun na comhairle no an chóluchta san do chur ar ath-ló; cialluíonn an abairt “Toghachán Reachtúil” toghachán chun líona áiteanna comhairleoirí, coimisinéirí no ball cóluchta áitiúla a eireoidh as ar chríochnú a dtéarma oifige; cialluíonn an abairt “Dáta Ceaptha” an dáta a leagfaidh an t-Aire amach fén Acht so chun comóra na dtoghachán reachtúil chun na comhairle, chun an chóluchta coimisinéirí no chun an chóluchta áitiúla eile go mbaineann an abairt leis; cialluíonn an abairt “An t-Aire” an t-Aire um Rialtas Áitiúil; cialluíonn an abairt “Cólucht Áitiúil” aon chólucht go n-éilítear do réir aon reachta, no fé, a chuntaisí do scrúdú ag scrúdóir a cheapfaidh an t-Aire; foluíonn an focal “Reacht” Acht de Pháirlimint na Breataine ag a bhfuil feidhm dlí i Saorstát Éireann chó maith le hAcht den Oireachtas

source: —This Act may be cited as the Local Elections Postponement Act, 1922
ga: —Féadfar an t-Acht chun Toghacháin Áitiúla do chur ar Ath-ló, 1922 , do ghairm don Acht so
